InformationRegisters/ЛБ_НастройкаРеквизитовДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаРеквизитовДокументовЗалогодателя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСимволов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоЦифры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидГражданства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыГражданства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_РеквизитыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДокументовЗалогодателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДокументовЗалогодателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийПравоПребыванияРФ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаИзмененияДокументаЗалогодателя/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Параметры.Свойство("ТолькоПросмотр") И НЕ Параметры.ТолькоПросмотр = неопределено Тогда
		Элементы.ЗаписатьИЗакрыть.Доступность = ?(Параметры.ТолькоПросмотр, ложь, истина);
	КонецЕсли;	
	Если Параметры.Свойство("Залогодатель") Тогда
		Залогодатель = Параметры.Залогодатель;	
	КонецЕсли;	
	Если Параметры.Свойство("Гражданство") Тогда
		ДокументГражданство = Параметры.Гражданство;
	КонецЕсли;
	Если Параметры.Свойство("ДатаРождения") Тогда
		ДатаРождения = Параметры.ДатаРождения;
	КонецЕсли;
	Если Параметры.Свойство("ДокументЗалогодателя") Тогда
		ДокументЗалогодателя = Параметры.ДокументЗалогодателя;
	КонецЕсли;
	
	// ++ Сербаев 24.05.2023 TODO: Сербаев
	Если Параметры.Свойство("СтранаЭмитент") Тогда
		ДокументСтранаЭмитент = Параметры.СтранаЭмитент;	
	КонецЕсли;
	// -- Сербаев 24.05.2023  
	// ++ Сербаев 14.06.2023 (иной документ)
	Если Параметры.Свойство("ДокументНаименованиеИногоДокумента") Тогда
		ДокументНаименованиеИногоДокумента = Параметры.НаименованиеИногоДокумента;	
	КонецЕсли;
    // -- Сербаев 14.06.2023   
	
	Если Параметры.Свойство("НачалоДействия") Тогда  
		ДокументНачалоДействия = Параметры.НачалоДействия;  
	Иначе
		ДокументНачалоДействия = НачалоДня(ТекущаяДата());
	КонецЕсли;	
	
	Если Параметры.Свойство("КлючСтроки") Тогда
		КлючСтроки = Параметры.КлючСтроки;	
	   	ЗаполнитьИнформациюОДокументе(Параметры); 
		Если ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
		    Элементы.ИнформацияПаспортРФ.Видимость = Истина;
			ИнформацияПаспортВСпискеНеддействительныхПаспортов();
	    КонецЕсли;			
	Иначе
		Элементы.ДокументНеДействителен.ТолькоПросмотр = Истина;   
		Элементы.ДокументДействителен.ТолькоПросмотр = Истина;   
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВидДокументаЗалогодателя) Тогда
		ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ВидДокумента) Тогда
		ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ДокументГражданство) Тогда
		СписокВыбораВидов = ПолучитьДоступныеВидыДокументовЗалогодателя();
		Элементы.ВидДокументаЗалогодателя.СписокВыбора.Очистить();
		Для каждого Эл Из СписокВыбораВидов Цикл
			Элементы.ВидДокументаЗалогодателя.СписокВыбора.Добавить(Эл.Значение);
		КонецЦикла;	
	КонецЕсли;	
	Если ЗначениеЗаполнено(ВидДокументаЗалогодателя) И ЗначениеЗаполнено(ДокументГражданство) Тогда
		СписокВыбораВидов = ПолучитьДоступныеВидыДокументов();
		Элементы.ВидДокумента.СписокВыбора.Очистить();
		Для каждого Эл Из СписокВыбораВидов Цикл
			Элементы.ВидДокумента.СписокВыбора.Добавить(Эл.Значение);
		КонецЦикла;	
	КонецЕсли;
	
	// ++ Сербаев 24.05.2023 TODO: Сербаев
	Если Не ЗначениеЗаполнено(ДокументСтранаЭмитент) Тогда
		Если ДокументГражданство = Справочники.СтраныМира.Россия Тогда
			ДокументСтранаЭмитент = ДокументГражданство;
		ИначеЕсли ДокументГражданство = Справочники.СтраныМира.БезГражданства Тогда
			Если ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда
			    ДокументСтранаЭмитент = Справочники.СтраныМира.Россия;
			Иначе 
			    ДокументСтранаЭмитент = ДокументГражданство;
			КонецЕсли;
		Иначе		
			Если ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ Тогда
			    ДокументСтранаЭмитент = Справочники.СтраныМира.Россия;
			Иначе 
			    ДокументСтранаЭмитент = ДокументГражданство;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
    // -- Сербаев 24.05.2023
	
	УстановитьВидимость();	
КонецПроцедуры 

&НаСервере
Процедура ИнформацияПаспортВСпискеНеддействительныхПаспортов()
	Если ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда  
		Если НЕ ПустаяСтрока(ДокументСерия) И НЕ ПустаяСтрока(ДокументНомер) Тогда 
			Элементы.ИнформацияПаспортРФ.Видимость = Истина;
			Парам = Новый Структура("Серия, Номер", СокрЛП(ДокументСерия), СокрЛП(ДокументНомер));
			Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда
				Элементы.ИнформацияПаспортРФ.ЦветТекста = WebЦвета.Красный;
				Элементы.ИнформацияПаспортРФ.Заголовок = "Паспорт найден в списке недействительных паспортов";  
				Элементы.ДокументДействителен.ТолькоПросмотр = ложь;
			Иначе
				Элементы.ИнформацияПаспортРФ.ЦветТекста = WebЦвета.Зеленый;
				Элементы.ИнформацияПаспортРФ.Заголовок = "Паспорт не найден в списке недействительных паспортов";
				Элементы.ДокументДействителен.ТолькоПросмотр = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимость()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", ВидДокументаЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Реквизит КАК Реквизит,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Обязателен КАК Обязателен,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Видимость КАК Видимость,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.КоличествоСимволов КАК КоличествоСимволов,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ТолькоЦифры КАК ТолькоЦифры
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя КАК ЛБ_НастройкаРеквизитовДокументовЗалогодателя
	               |ГДЕ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокумента = &ВидДокумента
	               |	И ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		ЭлементФормы = Элементы[Выборка.Реквизит.ИмяПредопределенныхДанных];
		Если НЕ Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументКодПодразделения Тогда
		    Элементы[Выборка.Реквизит.ИмяПредопределенныхДанных].Маска = "";
		КонецЕсли;	
		Если НЕ Выборка.Обязателен Тогда
			ЭлементФормы.АвтоОтметкаНезаполненного = Ложь;
		КонецЕсли;
		ЭлементФормы.Видимость = Выборка.Видимость; 
		Если НЕ Выборка.КоличествоСимволов = 0 Тогда
			Если НЕ Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументКодПодразделения Тогда
				Маска = "";
				Если Выборка.ТолькоЦифры Тогда					
					Если НЕ ЗначениеЗаполнено(Маска) Тогда
						Для сч = 0 По Выборка.КоличествоСимволов - 1 Цикл
							Маска = Маска + "9";
						Конеццикла;	
					КонецЕсли;	
				КонецЕсли;          
				Элементы[Выборка.Реквизит.ИмяПредопределенныхДанных].Маска = Маска;
			КонецЕсли;
		ИначеЕсли (Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументНомер) ИЛИ (Выборка.Реквизит = Справочники.ЛБ_РеквизитыДокументовЗалогодателя.ДокументСерия) Тогда
            Маска = "";
			Если Выборка.ТолькоЦифры Тогда					
				Если НЕ ЗначениеЗаполнено(Маска) Тогда
					Для сч = 0 По Выборка.КоличествоСимволов - 1 Цикл
						Маска = Маска + "9";
					Конеццикла;	
				КонецЕсли;	
			КонецЕсли;
			Элементы[Выборка.Реквизит.ИмяПредопределенныхДанных].Маска = Маска;
		КонецЕсли;	
	Конеццикла;	
	Если ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти") Тогда
		Элементы.ДокументДатаСмерти.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИнформациюОДокументе(Параметры)
	ВидДокументаЗалогодателя = Параметры.ВидДокументаЗалогодателя;
	ВидДокумента = Параметры.ВидДокумента;
	ДокументГражданство = Параметры.Гражданство;
	ДокументСерия = Параметры.Серия;
	ДокументНомер = Параметры.Номер;
	ДокументДатаВыдачи = Параметры.ДатаВыдачи;
	ДокументКемВыдан = Параметры.КемВыдан;
	ДокументКодПодразделения = Параметры.КодПодразделения;
	ДокументСрокДействия = Параметры.СрокДействия;
	ДокументНеДействителен = Параметры.НеДействителен; 
	ДокументДействителен = Параметры.Действителен;
	ДокументДатаСмерти = Параметры.ДатаСмерти;

	// ++ Сербаев 24.05.2023 TODO: Сербаев
    ДокументСтранаЭмитент = Параметры.СтранаЭмитент; 
	// -- Сербаев 24.05.2023
	// ++ Сербаев 14.06.2023 (иной документ)
	ДокументНаименованиеИногоДокумента = Параметры.НаименованиеИногоДокумента;
    // -- Сербаев 14.06.2023
	
КонецПроцедуры	

&НаКлиенте
Процедура Записать(Команда)
	
	// ++ Сербаев 12.05.2023
	Если ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ВидНаЖительство") И 
		(ВидДокументаЗалогодателя = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ") И
		 ДокументСрокДействия = Дата(1, 1, 1) И 
		(ДокументГражданство <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия") И 
		 ДокументГражданство <> ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка"))) Тогда
		
		СпроситьСрокДействия = Истина;
	Иначе
		СпроситьСрокДействия = Ложь;
	КонецЕсли;		
	
	Если ПроверитьДокумент() Тогда
		
		Если СпроситьСрокДействия Тогда
			ВидНаЖительствоЯвляетсяБессрочным();
			Возврат;
		КонецЕсли;
		
		ЗакрытьФормуИзмененияДокумента();
		//СтруктураВозврата = Новый Структура;
		//СтруктураВозврата.Вставить("КлючСтроки", КлючСтроки);
		//СтруктураВозврата.Вставить("ВидДокументаЗалогодателя", ВидДокументаЗалогодателя);
		//СтруктураВозврата.Вставить("ВидДокумента", ВидДокумента);
		//СтруктураВозврата.Вставить("Гражданство", ДокументГражданство);
		//СтруктураВозврата.Вставить("Серия", ДокументСерия);
		//СтруктураВозврата.Вставить("Номер", ДокументНомер);
		//СтруктураВозврата.Вставить("ДатаВыдачи", ДокументДатаВыдачи);
		//СтруктураВозврата.Вставить("КемВыдан", ДокументКемВыдан);
		//СтруктураВозврата.Вставить("КодПодразделения", ДокументКодПодразделения);
		//СтруктураВозврата.Вставить("СрокДействия", ДокументСрокДействия);
		//СтруктураВозврата.Вставить("НеДействителен", ДокументНеДействителен); 
		//СтруктураВозврата.Вставить("Действителен", ДокументДействителен);
		//СтруктураВозврата.Вставить("ДатаСмерти", ДокументДатаСмерти);		
		//Закрыть(СтруктураВозврата);
		// -- Сербаев 12.05.2023
		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокумент()	
	ВсеОК = Истина;  
	Если ПроверитьЗаполнение() Тогда 
		Если (ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
		 (ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И ВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность) Тогда  
		    Если ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
				Парам = Новый Структура("Серия, Номер", СокрЛП(ДокументСерия), СокрЛП(ДокументНомер));
				Если НЕ (ДокументДействителен ИЛИ ДокументНеДействителен) Тогда
					Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
						Сообщить("Документ найден в списке недействительных паспортов!");
					    ВсеОК = ложь;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			Если ВсеОК И НЕ ДатаРождения = Дата(1,1,1) Тогда
				Если НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, ДокументДатаВыдачи) Тогда			
					Сообщить("Документ уже не действителен!");
				    ВсеОК = ложь;
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении Тогда
			Если НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(ДатаРождения) Тогда
				Сообщить("Документ уже не действителен!");
				ВсеОК = ложь;
			КонецЕсли;		
		ИначеЕсли ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(ДокументГражданство, ВидДокументаЗалогодателя, ВидДокумента) Тогда
			Если ДокументСрокДействия = Дата(1,1,1) Тогда
				Сообщить("Необходимо заполнить срок действия документа!");
			    ВсеОК = ложь;  
			ИначеЕсли ДокументСрокДействия < НачалоДня(ТекущаяДата()) Тогда
				Сообщить("Документ просрочен!");
		        ВсеОК = ложь;	
			КонецЕсли;	
		ИначеЕсли НЕ ДокументСрокДействия = Дата(1,1,1) Тогда
			Если ДокументСрокДействия < НачалоДня(ТекущаяДата()) Тогда
				Сообщить("Документ просрочен!");
		        ВсеОК = ложь;
			КонецЕсли;	
		КонецЕсли;
		// ++ Сербаев 08.06.2023  (Проверка документа Вид на жительство на действительность)
		Если ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
			СтруктудаД = Новый Структура("ДокументСрокДействия, ДокументДатаВыдачи", ДокументСрокДействия, ДокументДатаВыдачи); 
			Если Не ЛБ_ОбщийМодуль.ПроверитьДействительностьВидаНаЖительство(СтруктудаД, ДатаРождения) Тогда
			    ВсеОК = ложь;
			КонецЕсли;
		КонецЕсли;
        // -- Сербаев 08.06.2023         
		Если ЗначениеЗаполнено(ДокументСерия) ИЛИ ЗначениеЗаполнено(ДокументНомер) Тогда   
			Если ЗначениеЗаполнено(ДокументЗалогодателя) Тогда
		        НайденныйДокумент = ЛБ_ОбщийМодуль.ПроверитьЕстьДокумент(ДокументГражданство, ВидДокумента, ДокументСерия, ДокументНомер, ДокументЗалогодателя);
			Иначе
				НайденныйДокумент = ЛБ_ОбщийМодуль.ПроверитьЕстьДокумент(ДокументГражданство, ВидДокумента, ДокументСерия, ДокументНомер);
			КонецЕсли;	
			Если НЕ НайденныйДокумент = неопределено Тогда  
				НайденныйЗалогодатель = НайденныйДокумент.Владелец;
				Если НЕ (НайденныйЗалогодатель = Залогодатель) Тогда  
					Сообщить("В базе уже есть клиент " + СокрЛП(НайденныйЗалогодатель) + " с документом " + СокрЛП(ВидДокумента) + " серия " + СокрЛП(ДокументСерия) + " номер " + СокрЛП(ДокументНомер) +
					   ", найдите карточку клиента и внесите изменения (при необходимости).");
					ВсеОК = ложь;   
				Иначе 
					Сообщить("У клиента " + СокрЛП(Залогодатель) + " уже есть документ " + СокрЛП(ВидДокумента) + " серия " + СокрЛП(ДокументСерия) + " номер " + СокрЛП(ДокументНомер));					
					ВсеОК = ложь;  
				КонецЕсли;	
			КонецЕсли;  
		КонецЕсли;	
		Если НЕ ПроверитьПоНастройкам() Тогда
			ВсеОК = ложь;
		КонецЕсли;	
	Иначе
		ВсеОК = ложь;
	КонецЕсли;	
	Если НЕ (ДокументДатаВыдачи = Дата(1,1,1)) И (ДокументДатаВыдачи > КонецДня(ТекущаяДата())) Тогда
		Сообщить("Дата выдачи документа не может быть больше текущей даты!");
		ВсеОК = ложь;
	КонецЕсли;	
	Если НЕ (ДокументДатаВыдачи = Дата(1,1,1)) И (ДокументДатаВыдачи < НачалоДня(ДатаРождения)) Тогда
		Сообщить("Дата выдачи документа не может быть меньше даты рождения клиента!");
		ВсеОК = ложь;
	КонецЕсли;	
	Если ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти Тогда
		Если ДокументДатаСмерти = Дата(1,1,1) Тогда
			Сообщить("Небходимо заполнить дату смерти!");
		    ВсеОК = ложь;    
		ИначеЕсли ДокументДатаВыдачи < ДокументДатаСмерти Тогда
			Сообщить("Дата выдачи свидетельства о смерти не может быть меньше даты смерти!");
		    ВсеОК = ложь;
		КонецЕсли;	
	КонецЕсли;         
	
	Если ЗначениеЗаполнено(ДокументСерия) Тогда
		Если ЛБ_ОбщийМодуль.ПроверитьЕстьТолькоСпецСимволы(ДокументСерия) тогда
			Сообщить("Серия документа не может содержать только специальные символы!");
		    ВсеОК = ложь;
        КонецЕсли;
	КонецЕсли;  
	Если ЗначениеЗаполнено(ДокументНомер) Тогда
		Если ЛБ_ОбщийМодуль.ПроверитьЕстьТолькоСпецСимволы(ДокументНомер) тогда
			Сообщить("Номер документа не может содержать только специальные символы!");
		    ВсеОК = ложь;
        КонецЕсли;
	КонецЕсли;  
	Если ЗначениеЗаполнено(ДокументКемВыдан) Тогда
		Если ЛБ_ОбщийМодуль.ПроверитьЕстьТолькоСпецСимволы(ДокументКемВыдан) тогда
			Сообщить("Кем выдан документ не может содержать только специальные символы!");
		    ВсеОК = ложь;
        КонецЕсли;
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ДокументНаименованиеИногоДокумента) Тогда 
		Если ЛБ_ОбщийМодуль.ПроверитьЕстьТолькоСпецСимволы(ДокументНаименованиеИногоДокумента) тогда
			Сообщить("Название документа не может содержать только специальные символы!");
		    ВсеОК = ложь;
        КонецЕсли;
	КонецЕсли;     
	
	Если ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОСмерти Тогда
		Если ДокументДатаСмерти > ДокументНачалоДействия Тогда
			Сообщить("Дата смерти клиента не может быть позже даты создания свидетельства о смерти!");
		    ВсеОК = ложь;	 
		КонецЕсли;
	КонецЕсли;	

	Возврат ВсеОК;
КонецФункции 

// ++ Сербаев 12.05.2023 
&НаКлиенте
Процедура ЗакрытьФормуИзмененияДокумента()
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("КлючСтроки", КлючСтроки);
	СтруктураВозврата.Вставить("ВидДокументаЗалогодателя", ВидДокументаЗалогодателя);
	СтруктураВозврата.Вставить("ВидДокумента", ВидДокумента);
	СтруктураВозврата.Вставить("Гражданство", ДокументГражданство);
	СтруктураВозврата.Вставить("Серия", ДокументСерия);
	СтруктураВозврата.Вставить("Номер", ДокументНомер);
	СтруктураВозврата.Вставить("ДатаВыдачи", ДокументДатаВыдачи);
	СтруктураВозврата.Вставить("КемВыдан", ДокументКемВыдан);
	СтруктураВозврата.Вставить("КодПодразделения", ДокументКодПодразделения);
	СтруктураВозврата.Вставить("СрокДействия", ДокументСрокДействия);
	СтруктураВозврата.Вставить("НеДействителен", ДокументНеДействителен); 
	СтруктураВозврата.Вставить("Действителен", ДокументДействителен);
	СтруктураВозврата.Вставить("ДатаСмерти", ДокументДатаСмерти);
	//+МАН 04.12.25
	СтруктураВозврата.Вставить("НачалоДействия", ДокументНачалоДействия);
	//-МАН
	
	// ++ Сербаев 24.05.2023 TODO: Сербаев
	СтруктураВозврата.Вставить("СтранаЭмитент", ДокументСтранаЭмитент);
	// -- Сербаев 24.05.2023
	// ++ Сербаев 14.06.2023 (иной документ)
	СтруктураВозврата.Вставить("НаименованиеИногоДокумента", ДокументНаименованиеИногоДокумента);
    // -- Сербаев 14.06.2023
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры
 
&НаКлиенте
Функция ВидНаЖительствоЯвляетсяБессрочным()
	
	Оповещение = Новый ОписаниеОповещения("ВыборВидНаЖительствоЗавершение", ЭтотОбъект); 
	ПоказатьВопрос(Оповещение, "Вид на жительство является бессрочным?", РежимДиалогаВопрос.ДаНет, 0);
	
КонецФункции

&НаКлиенте
Процедура ВыборВидНаЖительствоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить окончание действия документа!'"), ,"ДокументСрокДействия");
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьФормуИзмененияДокумента();
	КонецЕсли;

КонецПроцедуры
// -- Сербаев 12.05.2023

&НаСервере
Функция ПроверитьПоНастройкам()
	Результат = Истина;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", ВидДокументаЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Реквизит КАК Реквизит,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.КоличествоСимволов КАК КоличествоСимволов,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ТолькоЦифры КАК ТолькоЦифры
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя КАК ЛБ_НастройкаРеквизитовДокументовЗалогодателя
	               |ГДЕ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокумента = &ВидДокумента
	               |	И ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя
	               |	И ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Видимость = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Реквизит = ЭтаФорма[Выборка.Реквизит.ИмяПредопределенныхДанных];
		Если НЕ Выборка.КоличествоСимволов = 0 Тогда
			Если НЕ СтрДлина(СокрЛП(Реквизит)) = Выборка.КоличествоСимволов Тогда
				Сообщить("Для документа " + СокрЛП(ВидДокумента) + " количество символов реквизита " + СокрЛП(Выборка.Реквизит) + " должно быть равным " + Строка(Выборка.КоличествоСимволов));
				Результат = ложь;
			КонецЕсли;	
		КонецЕсли;	
		Если Выборка.ТолькоЦифры ИЛИ Выборка.Реквизит.ИмяПредопределенныхДанных = "ДокументКодПодразделения" Тогда
			Если Выборка.Реквизит.ИмяПредопределенныхДанных = "ДокументКодПодразделения" Тогда
				Если ЛБ_ОбщегоНазначения.ПроверкаВсеСимволыНули(СокрЛП(Реквизит), "-") Тогда
					Сообщить("Для документа " + СокрЛП(ВидДокумента) + " реквизит " + СокрЛП(Выборка.Реквизит) + " не должен содержать только нули.");
				    Результат = ложь;
				КонецЕсли;	
			Иначе	
				Если НЕ ЛБ_ОбщийМодуль.ПроверкаТолькоЦифры(СокрЛП(Реквизит)) Тогда
					Сообщить("Для документа " + СокрЛП(ВидДокумента) + " реквизит " + СокрЛП(Выборка.Реквизит) + " должен содержать только цифры.");
				    Результат = ложь;
				КонецЕсли;
				Если ЛБ_ОбщегоНазначения.ПроверкаВсеСимволыНули(СокрЛП(Реквизит)) Тогда
					Сообщить("Для документа " + СокрЛП(ВидДокумента) + " реквизит " + СокрЛП(Выборка.Реквизит) + " не должен содержать только нули.");
				    Результат = ложь;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	Конеццикла;	
    Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура Отмена(Команда)
	 Закрыть(неопределено);
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеВидыДокументов()
	Возврат ЛБ_ОбщийМодуль.ПолучитьДоступныеВидыДокументов(ДокументГражданство, ВидДокументаЗалогодателя); 
КонецФункции	

&НаСервере
Функция ПолучитьДоступныеВидыДокументовЗалогодателя()
	Возврат ЛБ_ОбщийМодуль.ПолучитьДоступныеВидыДокументовЗалогодателя(ДокументГражданство); 
КонецФункции	
	
&НаКлиенте
Процедура ВидДокументаЗалогодателяПриИзменении(Элемент)
	
	// ++ Сербаев 24.05.2023 TODO: Сербаев
	Если ЗначениеЗаполнено(ВидДокументаЗалогодателя) Тогда
		Если ВидДокументаЗалогодателя = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийПравоПребыванияРФ") Тогда
		    ДокументСтранаЭмитент =  ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
		Иначе
		    ДокументСтранаЭмитент =  ДокументГражданство;
		КонецЕсли;
	КонецЕсли;	
    // -- Сербаев 24.05.2023
	
	Если ЗначениеЗаполнено(ВидДокументаЗалогодателя) И ЗначениеЗаполнено(ДокументГражданство) Тогда
		СписокВыбораВидов = ПолучитьДоступныеВидыДокументов();
		Элементы.ВидДокумента.СписокВыбора.Очистить();
		Для каждого Эл Из СписокВыбораВидов Цикл
			Элементы.ВидДокумента.СписокВыбора.Добавить(Эл.Значение);
		КонецЦикла;	
	КонецЕсли;    
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	Элементы.ИнформацияПаспортРФ.Видимость = Ложь;
	Если ВидДокумента = ПредопределенноеЗначение("Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ") Тогда
	    ИнформацияПаспортВСпискеНеддействительныхПаспортов();
    КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("ВидДокументаЗалогодателя", ВидДокументаЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Реквизит КАК Реквизит,
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.Обязателен КАК Обязателен
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаРеквизитовДокументовЗалогодателя КАК ЛБ_НастройкаРеквизитовДокументовЗалогодателя
	               |ГДЕ
	               |	ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокумента = &ВидДокумента
	               |	И ЛБ_НастройкаРеквизитовДокументовЗалогодателя.ВидДокументаЗалогодателя = &ВидДокументаЗалогодателя";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Если НЕ Выборка.Обязателен Тогда
			ИндексПоля = ПроверяемыеРеквизиты.Найти(Выборка.Реквизит.ИмяПредопределенныхДанных);
			Если ИндексПоля <> Неопределено Тогда
			    ПроверяемыеРеквизиты.Удалить(ИндексПоля);
			КонецЕсли;
		КонецЕсли;	
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументГражданствоПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ДокументГражданство) Тогда
		СписокВыбораВидов = ПолучитьДоступныеВидыДокументовЗалогодателя();
		Элементы.ВидДокументаЗалогодателя.СписокВыбора.Очистить();
		Для каждого Эл Из СписокВыбораВидов Цикл
			Элементы.ВидДокументаЗалогодателя.СписокВыбора.Добавить(Эл.Значение);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументДатаВыдачиПриИзменении(Элемент)
	Если ДокументДатаВыдачи > КонецДня(ТекущаяДата()) Тогда
		Сообщить("Дата выдачи документа не может быть больше текущей даты!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументСерияПриИзменении(Элемент)
	ИнформацияПаспортВСпискеНеддействительныхПаспортов();
КонецПроцедуры

&НаКлиенте
Процедура ДокументНомерПриИзменении(Элемент)
	ИнформацияПаспортВСпискеНеддействительныхПаспортов();
КонецПроцедуры

&НаКлиенте
Процедура ДокументНеДействителенПриИзменении(Элемент)
	Если ДокументНеДействителен Тогда 
		Если ДокументДействителен Тогда
			ДокументДействителен = Ложь;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументДействителенПриИзменении(Элемент)
	Если ДокументДействителен Тогда 
		Если ДокументНеДействителен Тогда
			ДокументНеДействителен = Ложь;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
